; φ = (1 + √5) / 2
; ψ = (1 - √5) / 2
; φ ^ 2 = φ + 1
; ψ ^ 2 = ψ + 1
;
; Let's say A(n) states Fib(n) = (φ ^ n - ψ ^ n) / √5
;
; Initial steps: A(0) and A(1)
; Fib(0) = 0
;        = (φ ^ 0 - ψ ^ 0) / 2
; Fib(1) = 1
;        = (φ ^ 1 - ψ ^ 1) / 2
;
; Induction step: (∀n ∈ N) [A(n) ∩ A(n + 1) => A(n + 2)]
; Fib(n + 2) = Fib(n + 1) + Fib(n)
;            = (φ ^ (n + 1) - ψ ^ (n + 1) + φ ^ n - ψ ^ n) / √5
;            = (φ ^ n * (φ + 1) - ψ ^ n * (ψ + 1)) / √5
;            = (φ ^ n * φ ^ 2 - ψ ^ n * ψ ^ 2) / √5
;            = (φ ^ (n + 2) - ψ ^ (n + 2)) / √5
;
; By induction, (∀n ∈ N) A(n) is proved.
;
; Fib(n) = φ ^ n / √5 - ψ ^ n / √5
;
; -1 < ψ < 0 => -1 < ψ ^ n <= 1
; 2 < √5 => -1/2 < ψ ^ n / √5 < 1/2
; -1/2 < Fib(n) - φ ^ n / √5 < 1/2
